ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_CFG.xml
<module name="PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rxcfg0" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rxcfg0" offset="0x0" width="32" description="MIIRXCFG0Register">
		<bitfield id="RX_EOF_SCLR_DIS0" width="1" begin="9" end="9" resetval="0x0" description="" range="9" rwaccess="R/W"/> 
		<bitfield id="RX_ERR_RAW0" width="1" begin="8" end="8" resetval="0x0" description="" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_SFD_RAW0" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R/W"/> 
		<bitfield id="RX_AUTO_FWD_PRE0" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_BYTE_SWAP0" width="1" begin="5" end="5" resetval="0x0" description="" range="5" rwaccess="R/W"/> 
		<bitfield id="RX_L2_EN0" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/> 
		<bitfield id="RX_MUX_SEL0" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W"/> 
		<bitfield id="RX_CUT_PREAMBLE0" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="RX_DATA_RDY_MODE_DIS0" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/> 
		<bitfield id="RX_ENABLE0" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rxcfg1" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rxcfg1" offset="0x4" width="32" description="MIIRXCFG1Register">
		<bitfield id="RX_EOF_SCLR_DIS1" width="1" begin="9" end="9" resetval="0x0" description="" range="9" rwaccess="R/W"/> 
		<bitfield id="RX_ERR_RAW1" width="1" begin="8" end="8" resetval="0x0" description="" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_SFD_RAW1" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R/W"/> 
		<bitfield id="RX_AUTO_FWD_PRE1" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_BYTE_SWAP1" width="1" begin="5" end="5" resetval="0x0" description="" range="5" rwaccess="R/W"/> 
		<bitfield id="RX_L2_EN1" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/> 
		<bitfield id="RX_MUX_SEL1" width="1" begin="3" end="3" resetval="0x1" description="" range="3" rwaccess="R/W"/> 
		<bitfield id="RX_CUT_PREAMBLE1" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="RX_DATA_RDY_MODE_DIS1" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/> 
		<bitfield id="RX_ENABLE1" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_txcfg0" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_txcfg0" offset="0x10" width="32" description="MIITXCFG0Register">
		<bitfield id="TX_CLK_DELAY0" width="3" begin="30" end="28" resetval="0x0" description="" range="30 - 28" rwaccess="R/W"/> 
		<bitfield id="TX_START_DELAY0" width="10" begin="25" end="16" resetval="0x64" description="" range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="TX_IPG_WIRE_CLK_EN0" width="1" begin="12" end="12" resetval="0x0" description="" range="12" rwaccess="R/W"/> 
		<bitfield id="TX_32_MODE_EN0" width="1" begin="11" end="11" resetval="0x0" description="" range="11" rwaccess="R/W"/> 
		<bitfield id="PRE_TX_AUTO_ESC_ERR0" width="1" begin="10" end="10" resetval="0x0" description="" range="10" rwaccess="R/W"/> 
		<bitfield id="PRE_TX_AUTO_SEQUENCE0" width="1" begin="9" end="9" resetval="0x0" description="" range="9" rwaccess="R/W"/> 
		<bitfield id="TX_MUX_SEL0" width="1" begin="8" end="8" resetval="0x1" description="" range="8" rwaccess="R/W"/> 
		<bitfield id="TX_BYTE_SWAP0" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W"/> 
		<bitfield id="TX_EN_MODE0" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="TX_AUTO_PREAMBLE0" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/> 
		<bitfield id="TX_ENABLE0" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_txcfg1" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_txcfg1" offset="0x14" width="32" description="MIITXCFG1Register">
		<bitfield id="TX_CLK_DELAY1" width="3" begin="30" end="28" resetval="0x0" description="" range="30 - 28" rwaccess="R/W"/> 
		<bitfield id="TX_START_DELAY1" width="10" begin="25" end="16" resetval="0x64" description="" range="25 - 16" rwaccess="R/W"/> 
		<bitfield id="TX_IPG_WIRE_CLK_EN1" width="1" begin="12" end="12" resetval="0x0" description="" range="12" rwaccess="R/W"/> 
		<bitfield id="TX_32_MODE_EN1" width="1" begin="11" end="11" resetval="0x0" description="" range="11" rwaccess="R/W"/> 
		<bitfield id="PRE_TX_AUTO_ESC_ERR1" width="1" begin="10" end="10" resetval="0x0" description="" range="10" rwaccess="R/W"/> 
		<bitfield id="PRE_TX_AUTO_SEQUENCE1" width="1" begin="9" end="9" resetval="0x0" description="" range="9" rwaccess="R/W"/> 
		<bitfield id="TX_MUX_SEL1" width="1" begin="8" end="8" resetval="0x0" description="" range="8" rwaccess="R/W"/> 
		<bitfield id="TX_BYTE_SWAP1" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W"/> 
		<bitfield id="TX_EN_MODE1" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="TX_AUTO_PREAMBLE1" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/> 
		<bitfield id="TX_ENABLE1" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_tx_crc0" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_tx_crc0" offset="0x20" width="32" description="MIITXCRC0Register">
		<bitfield id="TX_CRC0" width="32" begin="31" end="0" resetval="0x0" description="Transmit CRC for last packet" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_tx_crc1" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_tx_crc1" offset="0x24" width="32" description="MIITXCRC1Register">
		<bitfield id="TX_CRC1" width="32" begin="31" end="0" resetval="0x0" description="Transmit CRC for last packet" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_tx_ipg0" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_tx_ipg0" offset="0x30" width="32" description="MIITXIPG0Register">
		<bitfield id="TX_IPG0" width="16" begin="15" end="0" resetval="0x40" description="Transmit IPG" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_tx_ipg1" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_tx_ipg1" offset="0x34" width="32" description="MIITXIPG1Register">
		<bitfield id="TX_IPG1" width="16" begin="15" end="0" resetval="0x40" description="Transmit IPG" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_prs0" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_prs0" offset="0x38" width="32" description="MIIPortStatus0Register">
		<bitfield id="SYNC_PORT0_CRS" width="1" begin="1" end="1" resetval="0x0" description="sync_port0_crs" range="1" rwaccess="R"/> 
		<bitfield id="SYNC_PORT0_COL" width="1" begin="0" end="0" resetval="0x0" description="sync_port0_col" range="0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_prs1" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_prs1" offset="0x3C" width="32" description="MIIPortStatus1Register">
		<bitfield id="SYNC_PORT1_CRS" width="1" begin="1" end="1" resetval="0x0" description="sync_port1_crs" range="1" rwaccess="R"/> 
		<bitfield id="SYNC_PORT1_COL" width="1" begin="0" end="0" resetval="0x0" description="sync_port1_col" range="0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_frms0" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_frms0" offset="0x40" width="32" description="MIIRXFRMS0Register">
		<bitfield id="RX_MAX_FRM0" width="16" begin="31" end="16" resetval="0x1521" description="rx_max_frm0" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="RX_MIN_FRM0" width="16" begin="15" end="0" resetval="0x63" description="rx_min_frm0" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_frms1" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_frms1" offset="0x44" width="32" description="MIIRXFRMS1Register">
		<bitfield id="RX_MAX_FRM1" width="16" begin="31" end="16" resetval="0x1521" description="rx_max_frm1" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="RX_MIN_FRM1" width="16" begin="15" end="0" resetval="0x63" description="rx_min_frm1" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_pcnt0" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_pcnt0" offset="0x48" width="32" description="MIIRXPCNT0Register">
		<bitfield id="RX_MAX_PCNT0" width="5" begin="8" end="4" resetval="0x14" description="rx_max_pcnt0" range="8 - 4" rwaccess="R/W"/> 
		<bitfield id="RX_MIN_PCNT0" width="4" begin="3" end="0" resetval="0x1" description="rx_min_pcnt0" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_pcnt1" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_pcnt1" offset="0x4C" width="32" description="MIIRXPCNT1Register">
		<bitfield id="RX_MAX_PCNT1" width="5" begin="8" end="4" resetval="0x14" description="rx_max_pcnt1" range="8 - 4" rwaccess="R/W"/> 
		<bitfield id="RX_MIN_PCNT1" width="4" begin="3" end="0" resetval="0x1" description="rx_min_pcnt1" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_err0" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_err0" offset="0x50" width="32" description="MIIRXERR0Register">
		<bitfield id="RX_MAX_FRM_ERR0" width="1" begin="3" end="3" resetval="0x0" description="rx_max_frm_err0" range="3" rwaccess="R/W1C"/> 
		<bitfield id="RX_MIN_FRM_ERR0" width="1" begin="2" end="2" resetval="0x0" description="rx_min_frm_err0" range="2" rwaccess="R/W1C"/> 
		<bitfield id="RX_MAX_PCNT_ERR0" width="1" begin="1" end="1" resetval="0x0" description="rx_max_pcnt_err0" range="1" rwaccess="R/W1C"/> 
		<bitfield id="RX_MIN_PCNT_ERR0" width="1" begin="0" end="0" resetval="0x0" description="rx_min_pcnt_err0" range="0" rwaccess="R/W1C"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_err1" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_err1" offset="0x54" width="32" description="MIIRXERR1Register">
		<bitfield id="RX_MAX_FRM_ERR1" width="1" begin="3" end="3" resetval="0x0" description="rx_max_frm_err1" range="3" rwaccess="R/W1C"/> 
		<bitfield id="RX_MIN_FRM_ERR1" width="1" begin="2" end="2" resetval="0x0" description="rx_min_frm_err1" range="2" rwaccess="R/W1C"/> 
		<bitfield id="RX_MAX_PCNT_ERR1" width="1" begin="1" end="1" resetval="0x0" description="rx_max_pcnt_err1" range="1" rwaccess="R/W1C"/> 
		<bitfield id="RX_MIN_PCNT_ERR1" width="1" begin="0" end="0" resetval="0x0" description="rx_min_pcnt_err1" range="0" rwaccess="R/W1C"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_fifo_level0" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_fifo_level0" offset="0x60" width="32" description="MIIRXFIFOLEVEL0Register">
		<bitfield id="RX_FIFO_LEVEL0" width="8" begin="7" end="0" resetval="0x0" description="rx_fifo_level0" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_fifo_level1" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_rx_fifo_level1" offset="0x64" width="32" description="MIIRXFIFOLEVEL1Register">
		<bitfield id="RX_FIFO_LEVEL1" width="8" begin="7" end="0" resetval="0x0" description="rx_fifo_level1" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_tx_fifo_level0" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_tx_fifo_level0" offset="0x68" width="32" description="MIIRXFIFOLEVEL0Register">
		<bitfield id="TX_FIFO_LEVEL0" width="8" begin="7" end="0" resetval="0x0" description="tx_fifo_level0" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_CFG__REGS_tx_fifo_level1" acronym="PR1_MII_RT__PR1_MII_RT_CFG__REGS_tx_fifo_level1" offset="0x6C" width="32" description="MIIRXFIFOLEVEL1Register">
		<bitfield id="TX_FIFO_LEVEL1" width="8" begin="7" end="0" resetval="0x0" description="tx_fifo_level1" range="7 - 0" rwaccess="R"/>
	</register>
</module>